{
    "reading_time": "about one minute", 
    "month": "06", 
    "year": "2010", 
    "date": "June 02, 2010", 
    "slug": "twitter-success-story-hurricane-bill", 
    "contents": "<div class=\"section\" id=\"twitter-success-story-hurricane-bill\">\n<h1>Twitter Success Story - Hurricane&nbsp;Bill</h1>\n<p>Beginners often find Twitter very confusing and useless. I think it&#8217;s because\nthey come to it with some preconceived ideas, and when Twitter doesn&#8217;t fit\ntheir model they get frustrated. This series is meant to show why Twitter is so\nuseful and how it&#8217;s different from other social&nbsp;networks.</p>\n<p>My family and I live in the city of Aberdeen in Scotland. My wife is originally\nfrom Halifax, Canada where her parents still live. In August of last year,\nthere was a hurricane threat to the Halifax area. The hurricane was slowly\nmaking its way up the coast towards Halifax, and was to strike the city around\n8:<span class=\"caps\">00AM</span> on a Sunday morning. Naturally, we were in touch with my in-laws and\nkept checking news sites for&nbsp;updates.</p>\n<p>However, as you might expect the news companies were closed (or at least on\nlimited staff) on that Sunday morning. We googled and googled and couldn&#8217;t find\nany updates on the hurricane. Did it hit the city? Is it serious? Has\nelectricity been cut&nbsp;off?</p>\n<p>Twitter is a source of real-time information. With the right query, you can get\nupdates and news just about anything. So, I searched for &#8220;hurricane bill\nhalifax&#8221; and just watched the tweets come in. At first, there wasn&#8217;t much. But\nas time went by, people started talking about the hurricane. Some were saying\nthat the sky is a bit darker, some were seeing a little rain, etc. I even found\none user who actually went to the Halifax harbour to watch the hurricane come\nin. He was posting images from his cell phone to show us what the weather was&nbsp;like.</p>\n<p>Thanks to Twitter we were able to follow the development of the hurricane\nalmost minute by minute. In the end, there wasn&#8217;t much of hurricane after all.\nBy the time it got to Halifax, it had reduced to a mere&nbsp;storm.</p>\n</div>\n", 
    "date_iso": "2010-06-02", 
    "title": "Twitter Success Story - Hurricane Bill", 
    "url": "/2010/06/twitter-success-story-hurricane-bill", 
    "day": "02", 
    "categories": [
        {
            "name": "Twitter", 
            "slug": "twitter"
        }
    ]
}