{
    "reading_time": "2 minutes", 
    "month": "12", 
    "year": "2011", 
    "date": "December 22, 2011", 
    "slug": "interpretation-mistakes", 
    "contents": "<div class=\"section\" id=\"interpretation-mistakes\">\n<h1>Interpretation&nbsp;mistakes</h1>\n<p>Many people today who claim to be and likely are sincere followers of Jesus\nChrist aren&#8217;t properly educated in the discipline of biblical exegesis and\ninterpretation. Of course not everyone can or wants to go to seminary to study\nthis topic. We can&#8217;t fault people to be ignorant about rather complex&nbsp;matters.</p>\n<p>However, an introduction to the art of interpretation wouldn&#8217;t hurt anyone. My\nreasoning behind this assertion is that the lack of basic understanding of\nexegesis causes <em>unnecessary</em> conflict within the church. In the rest of this\narticles, I would like to show an example of this. Please bear in mind that the\narguments presented here aren&#8217;t meant to convince anyone of any particular\nposition, but rather, to show how difficult these arguments can&nbsp;be.</p>\n<p>Let&#8217;s dive right in. Many people in the church today argue over the issue of\nwomen&#8217;s position within the Christian society. Some argue that they are equal\nto men in all regards and some argue that God created men and women in his\nimage but for different purposes. This becomes an issue in two particular\npassages: Ephesians 5 where we learn of how the husband and the wife are to\nconduct themselves in the marriage; and 1 Timothy 2 where Paul forbids women\nfrom entering into the office of an&nbsp;elder.</p>\n<p>Let&#8217;s look at the Ephesians passage first. When women read that passage, the\nfirst thing they think is that they are by no means going submit to their\nhusbands because they live in a society that doesn&#8217;t discriminated based on\ngender. They dismiss the biblical account based on how they see themselves in\nthe 21st century society. The Pauline theology is deemed out-dated and\nirrelevant to the modern person. If instead they read on and paid attention to\nwhat the husband&#8217;s responsibilities are, they might learn that much greater\nburden is placed upon him. The husband is to love his wife with the same love\nthat Christ loves the church! The same love with which the Father loves the\nSon. The sacrificial love that allowed Jesus to suffer and die for undeserving\nsinners. And that&#8217;s no small&nbsp;task!</p>\n<p>The passage from Timothy is dismissed on similar grounds. A women is as able as\na man and shouldn&#8217;t be told to refrain from entering into office based on her\nbeing a woman. However, this passage says nothing of competency or\nintelligence. The passage in question in question reads as&nbsp;follows:</p>\n<blockquote>\nI do not permit a woman to teach or to exercise authority over a man;\nrather, she is to remain quiet. For Adam was formed first, then Eve; and\nAdam was not deceived, but the woman was deceived and became a\ntransgressor. 1 Timothy 2:12-14</blockquote>\n<p>In this case, it&#8217;s a question of language that is being ignored. What is Paul&#8217;s\nreason for forbidding the woman from teaching? The order of creation. When God\nwas finished creating the world, he announced that it was very good. This was\nbefore the sin entered into the world. Paul <em>grounds</em> his argument in the work\nof God. He follows God&#8217;s hand in history and is consistent with it. This means\nthat we cannot dismiss this instruction as having come from a particular city\nwhere women were causing problems and meaning that it doesn&#8217;t apply to&nbsp;us.</p>\n<p>The biggest problem in today&#8217;s layperson interpretation is that they project\ntheir own ideas onto the biblical text and refuse to accept those verses and\nideas that don&#8217;t align with they own. This is a very flawed approach. Rather,\nwe should approach the Bible with an attitude of awe, expecting the God of the\nuniverse to speak to use in his infinite wisdom. Sadly, a great many people\ntoday choose to ignore their God and pursue their own egos and&nbsp;agendas.</p>\n</div>\n", 
    "date_iso": "2011-12-22", 
    "title": "Interpretation mistakes", 
    "url": "/2011/12/interpretation-mistakes", 
    "day": "22", 
    "categories": [
        {
            "name": "theology", 
            "slug": "theology"
        }
    ]
}