{
    "reading_time": "about one minute", 
    "month": "10", 
    "year": "2011", 
    "date": "October 01, 2011", 
    "slug": "bible-translations-and-the-christian-life", 
    "contents": "<div class=\"section\" id=\"bible-translations-and-the-christian-life\">\n<h1>Bible translations and the Christian&nbsp;life</h1>\n<img alt=\"/img/agape-estin.jpg\" src=\"/img/agape-estin.jpg\" />\n<p>There are many English translations of the Bible. They were all made for\ndifferent audiences. They employ different translation techniques. Each\nChristian celebrity endorses a different&nbsp;translation.</p>\n<p>The truth of the matter is that a certain Bible translation can be elevated to\nsuch a degree that the common believer is made to believe that the translation\ncontains actual words of God. You need to realize that a translation is just\nthat: a translation. No matter how many scholars with the best schools you\ncommission to create this new, true translation of the Scriptures, it is bound\nto be imperfect in some way. One language cannot accurately convey the same\nmeaning as an another. Each language carries with it a certain culture, sense\nof humor and ways of expressing common&nbsp;idioms.</p>\n<p>This is perhaps a little hard to understand if you only speak one language. If\nyou have had to learn English and you moved to foreign country, this idea may\nbe clearer to&nbsp;you.</p>\n<p>So, where do you go from here? As you may know, the Bible was written in three\nlanguages: Hebrew, Aramaic and Greek. As Christians, we focus most of our\nattention on the New Testament which is written in&nbsp;Greek.</p>\n<p>I am going to suggest that if you are even remotely interested in serious study\nof the Word of God that you invest a few years of your life and learn New\nTestament Greek. Now you are thinking that I&#8217;m completely crazy. Bear with me\nfor a&nbsp;moment.</p>\n<p>The vocabulary of the New Testament is final. You don&#8217;t need to learn words\nlike <em>airplane</em>, <em>computer</em> or <em>email</em>. If you learn only 300 Greek words, you\nwill understand over 80% of the New Testament; double the amount and you will\nget up to 90%. I&#8217;m confident that after a year of casual study of Greek you can\nbegin to read some of the simpler passages (like 1 John). After another year,\nyou will read Paul&#8217;s writing without much&nbsp;hindrance.</p>\n<p>After 3-4 years, you will be ready to abandon reading the New Testament in\nEnglish altogether. Let that sink&nbsp;in.</p>\n<p>There are plenty of good resource for learning New Testament Greek. Both online\nand in&nbsp;print.</p>\n<p>One last thing: if you are in your twenties or event thirties and you expect to\nbe alive for another 50-60 years, wouldn&#8217;t it be a good investment to spend a\nfew years learning the language Paul, Luke, John and others spoke and wrote&nbsp;in?</p>\n</div>\n", 
    "date_iso": "2011-10-01", 
    "title": "Bible translations and the Christian life", 
    "url": "/2011/10/bible-translations-and-the-christian-life", 
    "day": "01", 
    "categories": [
        {
            "name": "theology", 
            "slug": "theology"
        }
    ]
}