{
    "reading_time": "2 minutes", 
    "month": "10", 
    "year": "2011", 
    "date": "October 21, 2011", 
    "slug": "on-why-we-lack-mature-christians", 
    "contents": "<div class=\"section\" id=\"on-why-we-lack-mature-christians\">\n<h1>On why we lack mature&nbsp;Christians</h1>\n<p>The leadership in the local church is often made up of very incompetent people.\nI don&#8217;t mean incompetent in the sense that they can&#8217;t lead. I mean in their\nknowledge and understanding of theology in general and of the gospel in\nparticular. The Bible says that the leaders in the church should be first and\nforemost able to teach. If you can&#8217;t teach the Bible, perform mature exegesis\non a text or even struggle to find a book in the Bible, you shouldn&#8217;t lead.\nYet, this happens all the time. I have a theory on how this&nbsp;happens.</p>\n<p>The local church often runs programs that are designed to attract seekers.\nPeople come and are lead to Christ. They pray the sinner&#8217;s prayer and are\nintroduced to church life. The original group of evangelists moves on to reach\nnew people and the new believer is left mostly alone in the sea of church\ngoers. There is rarely any follow-up. These people are left to themselves. New\nbelievers tend to be very excited about their new-found faith and they read\ntheir Bibles whenever they get a&nbsp;chance.</p>\n<p>Time goes on and these new believers learn to walk the walk and talk the talk\nin the church. They learn some key concepts about how church life works. They\nlearn stories from the gospels, they memorize a few verses from Paul&#8217;s epistles\nand they feel good about themselves. They listen to sermons, they go to prayer\nmeetings and help out where they can. On the outside, it seems that they have\nit all figured out and their walk with Christ has been&nbsp;fruitful.</p>\n<p>Once they have been in the church for some 30 years, they naturally gravitate\ntowards leadership roles. They are nominated to serve on the deacon&#8217;s board or\non the finance committee. Their sense of self-worth rises. They begin to think\nthat since they made it to their new leadership role, they must be a really\ngood Christian. After all, they have been in the church for over 30 years. They\nhave been coming every Sunday, participated in programs and lots&nbsp;more.</p>\n<p>However, they haven&#8217;t been under good Bible teaching. They haven&#8217;t read their\nBibles in years because they&#8217;ve got it all figured out. They know all the\nstories and parables. They know the hymns and worship songs. But they don&#8217;t\nknow basic Christian doctrine. They wouldn&#8217;t be able to explain to you the\ndoctrine of sanctification, justification or redemption. They lack\nunderstanding of the divine&nbsp;economy.</p>\n<p>Moreover, they haven&#8217;t walked with Christ and therefore lack the practical\nknowledge of his grace. They don&#8217;t pray on a daily basis to align their hearts\nwith the will of God. They are proud and feel a strong sense of entitlement and\ndeservedness. They don&#8217;t reflect on the depths of God and his royal\nmagnificence. They are obsessed with legalism and rule-keeping. They think that\nif they were able to make this far, anyone can. They value tradition. Why\nchange things if they have worked for so many years? They aren&#8217;t willing to\nlearn because they know it all. They won&#8217;t come to basic Christianity classes\nbecause it would be boring for&nbsp;them.</p>\n<p>The saddest thing about this reality is that we allow these unlearned people to\nmake decisions that impact the life of the wider&nbsp;congregation.</p>\n<p>What about those who grow up in the church? They have even tougher times\ngetting to the truth because of the older generation that is in power. If you\ndon&#8217;t read the Bible for yourself, why would you read it for to your children?\nIf you don&#8217;t understand a particular text in the Scriptures, how could your&nbsp;wife?</p>\n</div>\n", 
    "date_iso": "2011-10-21", 
    "title": "On why we lack mature Christians", 
    "url": "/2011/10/on-why-we-lack-mature-christians", 
    "day": "21", 
    "categories": [
        {
            "name": "theology", 
            "slug": "theology"
        }
    ]
}