{
    "reading_time": "2 minutes", 
    "month": "07", 
    "year": "2011", 
    "date": "July 18, 2011", 
    "slug": "on-prayer-and-the-closing-of-the-eyes", 
    "contents": "<div class=\"section\" id=\"on-prayer-and-the-closing-of-the-eyes\">\n<h1>On prayer and the closing of the&nbsp;eyes</h1>\n<p>Virtually every Christian has been taught that prayer is when you talk to God\nwith your eyes <em>closed</em>. We tell our children, &#8220;Close your eyes and we will\npray&#8221;. The idea of having your eyes closed when you pray is so engrained in our\nculture that we don&#8217;t give it a second&nbsp;thought.</p>\n<p>As protestant Christians, we believe that the Bible contains actual words of\nGod. We also believe in the sufficiency of the Bible&#8217;s instruction. Let&#8217;s\nsurvey the Scriptures and see what the proper mode and posture is when we&nbsp;pray.</p>\n<p>In the English Standard Version translation of the Bible, the word <em>pray</em>\noccurs ninety times. Fifty-three times of that is in the New Testament. These\nverses describe prayer as urgent and emotional. For example, the Psalmist&nbsp;exclaims:</p>\n<blockquote>\nGive attention to the sound of my cry, my King and my God, for to you do I\npray. (Psalm 5:2, <span class=\"caps\">ESV</span>)</blockquote>\n<p>In the New Testament, the disciples ask Jesus to teach them how to pray. The\napostle Paul prays for his coworkers in the gospel. Jesus often prayed in\nprivate, away from the crowds. However, we are not told any specifics. Jesus\nalso prayed in public. For example, in the story of feeding of the five&nbsp;thousand:</p>\n<blockquote>\nThen he ordered the crowds to sit down on the grass, and taking the five\nloaves and the two fish, he looked up to heaven and said a blessing.\n(Matthew 14:19, <span class=\"caps\">ESV</span>)</blockquote>\n<p>Jesus is looking up to heaven, possibly stretching his arms and is speaking to\nhis father. The lifting of hands or arms is also described in 1 Timothy where\nPaul is telling Timothy how a church service should be&nbsp;conducted:</p>\n<blockquote>\nI desire then that in every place the men should pray, lifting holy hands\nwithout anger or quarreling; (1 Timothy 2:8, <span class=\"caps\">ESV</span>)</blockquote>\n<p>The Bible records many occasions where people pray to their God but in no\ninstance does it describe or prescribe that the believer&#8217;s eyes be closed. Why\ndo we do it then? I can think of a few different reasons. One, we don&#8217;t want to\nembarrass the one leading the prayer; two, it helps us focus on the task at\nhand; or, three, we want others around us to know that we are praying and\nshouldn&#8217;t be&nbsp;disturbed.</p>\n<p>These reasons are understandable and certainly not sinful in any way. But I do\nbelieve that we rob ourselves of some joy by closing our eyes. If we only ever\npray with our eyes closed, we won&#8217;t pray very often. Prayer becomes a holy\nmoment that we plan ahead. Your prayer life should be an ongoing conversation\nwith your Father. Jesus prayed constantly. And so need&nbsp;we.</p>\n</div>\n", 
    "date_iso": "2011-07-18", 
    "title": "On prayer and the closing of the eyes", 
    "url": "/2011/07/on-prayer-and-the-closing-of-the-eyes", 
    "day": "18", 
    "categories": [
        {
            "name": "theology", 
            "slug": "theology"
        }
    ]
}