{
    "reading_time": "2 minutes", 
    "month": "04", 
    "year": "2012", 
    "date": "April 24, 2012", 
    "slug": "standing-desk-first-impressions", 
    "contents": "<div class=\"section\" id=\"standing-desk-first-impressions\">\n<h1>Standing desk - first&nbsp;impressions</h1>\n<p>I have recently switched jobs and had to set up a home office.  I have heard a\nlot of good things about standing desks and thought this was the perfect\nopportunity to try one.  I had looked for one online but those things aren&#8217;t\ncheap (~&nbsp;$800).</p>\n<p>Instead of dropping some serious cash, I stacked up some bins and made a\npoorman&#8217;s standing desk.  I have a laptop stand and a second monitor.  Nothing\nspecial,&nbsp;really.</p>\n<p>I have been standing while programming for over a week now and I wanted to\nshare a few thoughts.  If you&#8217;re wondering if you should get a standing desk,\nI&#8217;d definitely recommend&nbsp;it.</p>\n<div class=\"section\" id=\"incentives\">\n<h2>Incentives</h2>\n<p>I have set up my desk in such a way that if I want to sit down to do some work\nI have to give up the second monitor and my Das keyboard.  I use a 13&#8221; Macbook\nPro so the number of pixels is rather limited.  I <em>love</em> my loud Das keyboard\nand want to use it as much as possible.  This works extremely&nbsp;well.</p>\n</div>\n<div class=\"section\" id=\"breaks\">\n<h2>Breaks</h2>\n<p>When I take a break to have lunch with my family (or something like that), I\nmake it a point to sit down and rest my feet.  When I get back in the office, I\ndon&#8217;t feel like I&#8217;m gonna&nbsp;die.</p>\n</div>\n<div class=\"section\" id=\"distractions\">\n<h2>Distractions</h2>\n<p>I have found that when I&#8217;m standing I rarely check Hacker News or read\narticles.  I think it&#8217;s because reading an article or two isn&#8217;t complex enough\nfor my brain and it can do other things at the same time&#8212;like think about how\nmuch my feet hurt.  I find that when I&#8217;m standing I get a lot more done because\nI can focus a lot more.  Near the end of the day when I&#8217;m tired and actually do\nsit down to work, I feel like I&#8217;m walking under water.  Since I&#8217;m just getting\nstarted I have allowed myself some slack here and there.  I don&#8217;t want to go\ntoo fast and <em>burn out</em>.</p>\n</div>\n<div class=\"section\" id=\"dancing\">\n<h2>Dancing</h2>\n<p>I have heard that people like to dance when they&#8217;re standing at their desk.  I\nalways thought this was pretty silly until I caught myself doing it.  I listen\nto a lot of rock n roll so it&#8217;s not exactly&nbsp;surprising.</p>\n</div>\n<div class=\"section\" id=\"pain\">\n<h2>Pain</h2>\n<p>Obviously, your feet will hurt.  However, it&#8217;s not nearly as bad as I thought.\nI&#8217;m 23 and fairly fit so maybe that&#8217;s a factor.  I have had some minor lower\nback pain which I think is caused by the fact that I now have good posture and\nthe body isn&#8217;t used to&nbsp;it.</p>\n</div>\n<div class=\"section\" id=\"conclusion\">\n<h2>Conclusion</h2>\n<p>Do you stand while working?  Ever thought about getting a standing&nbsp;desk?</p>\n</div>\n</div>\n", 
    "date_iso": "2012-04-24", 
    "title": "Standing desk - first impressions", 
    "url": "/2012/04/standing-desk-first-impressions", 
    "day": "24", 
    "categories": [
        {
            "name": "Programming", 
            "slug": "programming"
        }
    ]
}