{
    "reading_time": "2 minutes", 
    "month": "05", 
    "year": "2012", 
    "date": "May 21, 2012", 
    "slug": "why-you-should-use-heroku-for-your-next-start-up", 
    "contents": "<div class=\"section\" id=\"why-you-should-use-heroku-for-your-next-start-up\">\n<h1>Why you should use Heroku for your next&nbsp;start-up</h1>\n<p>You are a ninja-rockstar developer with a billion dollar idea.  You write Ruby\nand Javascript.  You like <span class=\"caps\">BDD</span>, responsive design, <span class=\"caps\">HTML5</span> and node.js.  You are\nreally good at <span class=\"caps\">UX</span> and quickly producing a prototype.  You have been working on\nyour app for a few&nbsp;months.</p>\n<p>Now it&#8217;s time to deploy your&nbsp;app.</p>\n<p>Because you are a hot new start-up, you will of course use <span class=\"caps\">AWS</span>.  You spend a\nfew hours trying to figure out how many of which instance type you will need.\nYou decide you need a load balancer, a bunch of app servers, a database server\nand a worker server.  That should about cover you.  Next up is Chef.  You spend\na few days learning about provisioning a new <span class=\"caps\">VM</span> with Chef.  You are so excited\nabout how you can automatically provision a new app server when your start-up\nhits the front page of TechCrunch.  You spend a week configuring and testing\nyour Chef scripts.  And then the big day comes.  You deploy your application.\nEverything works the first time and you are overjoyed.  First users start to\nappear and your architecture performs really well.  You hit the front page of\nHackerNews and get tens of thousands of hits on your site.  You find a small\nbug in your cache invalidation logic which you fix really quickly.  You deploy\nyour fix and what do you know?  That script that installs your project&#8217;s\ndependencies when you deploy just pulled in a new version of a library that\ndeploys your static files to S3.  And of course that new version contains\nbackwards incompatible changes and completely breaks your app.  You are\nfrantically trying to figure out what happened.  You think, <span class=\"caps\">OK</span>, I will put up a\nmaintenance page while I sort this out.  You try to <span class=\"caps\">SSH</span> into your load balancer\nand try to change the routing settings.  What a mess.  What do you do when your\ndatabase starts swapping? What happens when your Redis server runs out of\nmemory and dies?  You barely understand how to install MySQL, let alone how to\nget the most out of&nbsp;it.</p>\n<p>Enter&nbsp;Heroku.</p>\n<p>Single command deployments.  Fully-managed database service.  Automatic\nload-balancing.  On-demand scaling.  No manual <span class=\"caps\">SSH</span> to see what&#8217;s&nbsp;wrong.</p>\n<p>A request comes in, the load balancer picks it up and sends it to a suitable\napp server instance.  The app server instance talks to a highly optimized\ndatabase instance.  Redis is sitting on a super beefy machine with lots of <span class=\"caps\">RAM</span>\nand you never have to worry about it.  When you are ready to make a deployment,\nthe load balancer bounces each app server in turn to make sure you don&#8217;t lose\nany requests.  All you need to do is <tt class=\"docutils literal\">git push heroku master</tt>.</p>\n<p>Sure, Heroku is a bit more expensive than <span class=\"caps\">EC2</span>.  But when you think of how many\nsmart people are taking care of your app, it&#8217;s really cheap.  It&#8217;s like having\nyour own sys&nbsp;admin.</p>\n<p>You need&nbsp;it.</p>\n<p><strong>Disclaimer</strong>: I&#8217;m in no way connected to Heroku.  This posts is an attempt to\nconvince myself that I shouldn&#8217;t be using Chef for my\nside-project-start-up-ideas.  And I&#8217;m not a Ruby&nbsp;guy.</p>\n</div>\n", 
    "date_iso": "2012-05-21", 
    "title": "Why you should use Heroku for your next start-up", 
    "url": "/2012/05/why-you-should-use-heroku-for-your-next-start-up", 
    "day": "21", 
    "categories": [
        {
            "name": "devops", 
            "slug": "devops"
        }
    ]
}