{
    "reading_time": "3 minutes", 
    "month": "04", 
    "year": "2013", 
    "date": "April 10, 2013", 
    "slug": "international-families", 
    "contents": "<div class=\"section\" id=\"international-families\">\n<h1>International&nbsp;families</h1>\n<p>I&#8217;m from the Czech republic.  My wife is from Canada.  We got married in\nCanada.  Our son was born in the United Kingdom.  Our daughter was born in\nCanada.  Both of our children are by birth Czech and Canadian at the same&nbsp;time.</p>\n<p>We want our children to be able to prove both of those citizenships and the\nfollowing is the&nbsp;process.</p>\n<div class=\"section\" id=\"our-son\">\n<h2>Our&nbsp;son</h2>\n<p>Our son Wyatt was born in the <span class=\"caps\">UK</span>.  He has a British birth certificate but is\nnot a British citizen.  In order to travel out of the <span class=\"caps\">UK</span>, he had to get a\npassport.  Because we now live in Canada, we decided it would make more sense\nto get the Canadian one done&nbsp;first.</p>\n<p>In order for someone without a Canadian birth certificate to get a Canadian\npassport, you need to get a proof of citizenship.  This is a piece of paper\nthat Wyatt will have to use for the rest of his life to prove his Canadian\ncitizenship instead of a birth certificate like all normal&nbsp;Canadians.</p>\n<p>So, to get a passport, you first need a proof of citizenship.  Wyatt is a\nCanadian citizen because his mother is Canadian.  In order to get the proof of\ncitizenship, you need to send a superlegalized British birth certificate to the\nCanadian government and include the mother&#8217;s birth certificate to prove the she\nis Canadian.  Super what?  Superlegalization is a process whereby Canada and\nthe <span class=\"caps\">UK</span> agree to authorize the use of each other&#8217;s legal documents.  Wyatt&#8217;s\nBritish birth certificate must be stamped by a Canadian embassy in the <span class=\"caps\">UK</span> to\nsay that this is in fact a legal document issued by the United Kingdom.  Also,\nalong with his application we had to send in our marriage&nbsp;certificate.</p>\n<p>Once he&#8217;s obtained the proof of citizenship, we can apply for a passport.\nFortunately, the Canadian government is nice enough to allow you to apply for\nthe proof of citizenship and the passport on one application.  We had his\npassport in a few&nbsp;weeks.</p>\n<p>Now we are living in Canada and want to get him all the papers he needs to be a\ntrue Czech citizen.  This means that we need to have his British birth\ncertificate legalized by the <span class=\"caps\">UK</span>, then translated into Czech by a\ngovernment-approved translator, then approved by the Ministry of Interior of\nthe Czech republic and then we can apply for a Czech birth certificate.  Of\ncourse, the application requires us to send in our marriage certificate.  Since\nwe got married in Canada, we have a Canadian marriage certificate.  This means\nthat we need to have to superlegalized, translated into Czech and approved by\nthe Ministry.  More fees and translators aren&#8217;t&nbsp;cheap.</p>\n<p>Once he has a Czech birth certificate, he needs to apply for a birth number\nwhich isn&#8217;t unlike a social security number except it&#8217;s derived from your date\nof&nbsp;birth.</p>\n</div>\n<div class=\"section\" id=\"our-daughter\">\n<h2>Our&nbsp;daughter</h2>\n<p>Our daughter Eliška was born in Canada.  This means she can fortunately get a\nCanadian passport without any issues.  She is a real Canadian like most people\nand doesn&#8217;t need to have any special paperwork to prove that she is.  Piece of&nbsp;cake.</p>\n<p>When it comes to the Czech side of things, it&#8217;s seems it&#8217;s much more\ncomplicated than with our&nbsp;son.</p>\n<p>First, she needs to apply for a proof of Czech citizenship.  Her Canadian birth\ncertificate needs to be superlegalized, translated and approved.  This is\nfortunately done at the Czech embassy in Ottawa and you are allowed to\ntranslate the document yourself and they will verify it for you.  One of the\nforms that you need to send in with the application requires you to have your\nsignature verified by a notary.  No big deal, right?  Well, good luck finding a\nnotary in Canada who speaks Czech and is willing to notarize your signature.  I\nwas emailing back and forth with the embassy that they allowed me to photocopy\nmy <span class=\"caps\">ID</span> and take that to the notary instead.  I&#8217;ll sign it in front of him and he\ncan verify my identity and signature.  I&#8217;ll send this in along with the\napplication.  The application process takes about 4-6 months according to their&nbsp;website.</p>\n<p>I have yet to apply for this.  But when it comes back, we will have to apply\nfor a Czech birth certificate and a birth number.  More forms, more fees, more\nsuperlegalization,&nbsp;etc.</p>\n</div>\n<div class=\"section\" id=\"conclusion\">\n<h2>Conclusion</h2>\n<p>No matter what you do, do not romanticize international families.  It&#8217;s not all\nthat fun all the&nbsp;time&#8230;</p>\n</div>\n</div>\n", 
    "date_iso": "2013-04-10", 
    "title": "International families", 
    "url": "/2013/04/international-families", 
    "day": "10", 
    "categories": [
        {
            "name": "rant", 
            "slug": "rant"
        }
    ]
}