{
    "reading_time": "5 minutes", 
    "month": "03", 
    "year": "2013", 
    "date": "March 01, 2013", 
    "slug": "calvin-on-predestination", 
    "contents": "<div class=\"section\" id=\"calvin-on-predestination\">\n<h1>Calvin on&nbsp;predestination</h1>\n<p><a class=\"reference external\" href=\"http://www.ccel.org/ccel/calvin/institutes.v.xxiii.html\">Book 3, chapter&nbsp;23</a></p>\n<blockquote>\n<p>When Paul declares that we were chosen in Christ before the foundation of\nthe world (Eph. 1:4), he certainly shows that no regard is had to our own\nworth; for it is just as if he had said, Since in the whole seed of Adam\nour heavenly Father found nothing worthy of his election, he turned his eye\nupon his own Anointed, that he might select as members of his body those\nwhom he was to assume into the fellowship of&nbsp;life.</p>\n<p>By saying they were elected before the foundation of the world, he takes\naway all reference to&nbsp;worth.</p>\n<p>In the additional statement that they were elected that they might be holy,\nthe apostle openly refutes the error of those who deduce election from\nprescience, since he declares that whatever virtue appears in men is the\nresult of&nbsp;election.</p>\n<p>Then, if a higher cause is asked, Paul answers that God so predestined, and\npredestined according to the good pleasure of his&nbsp;will.</p>\n<p>If you say that he foresaw they would be holy, and therefore elected them,\nyou invert the order of Paul.  You may, therefore, safely infer, If he\nelected us that we might be holy, he did not elect us because he foresaw\nthat we would be&nbsp;holy.</p>\n<p>Hence, what Christ said to his disciples is found to be universally\napplicable to all believers, &#8220;Ye have not chosen me, but I have chosen\nyou,&#8221; (John&nbsp;15:16)</p>\n<p>In another passage, to suppress the vain boasting of those who, while only\ncovered with a mask, claim for themselves in the view of the world a first\nplace among the godly, Paul says, &#8220;The Lord knoweth them that are his,&#8221; (2\nTim. 2:19). In short, by that term he designates two classes of people, the\none consisting of the whole race of Abraham, the other a people separated\nfrom that race, and though hidden from human view, yet open to the eye of\nGod. And there is no doubt that he took the passage from Moses, who\ndeclares that God would be merciful to whomsoever he&nbsp;pleased</p>\n<p><span class=\"dquo\">&#8220;</span>All that the Father giveth me shall come to me.&#8221; &#8220;And this is the Father&#8217;s\nwill which has sent me, that of all which he has given me I should lose\nnothing,&#8221; (John 6:37, 39). Observe that the donation of the Father is the\nfirst step in our delivery into the charge and protection of Christ. Some\none, perhaps, will here turn round and object, that those only peculiarly\nbelong to the Father who make a voluntary surrender by faith. But the only\nthing which Christ maintains is that though the defections of vast\nmultitudes should shake the world, yet the counsel of God would stand firm,\nmore stable than heaven itself, that his election would never fail. The\nelect are said to have belonged to the Father before he bestowed them on\nhis only begotten&nbsp;Son.</p>\n<p>We must, indeed hold, when he affirms that he knows whom he has chosen,\nfirst, that some individuals of the human race are denoted; and, secondly,\nthat they are not distinguished by the quality of their virtues, but by a\nheavenly decree. Hence it follows, that since Christ makes himself the\nauthor of election, none excel by their own strength or&nbsp;industry.</p>\n<p>For when he says, &#8220;Those that thou gavest me I have kept, and none of them\nis lost but the son of perdition,&#8221; (John 17:12), the expression, though\nthere is a catachresis in it, is not at all ambiguous. The sum is, that God\nby gratuitous adoption forms those whom he wishes to have for sons; but\nthat the intrinsic cause is in himself, because he is contented with his\nsecret&nbsp;pleasure.</p>\n<p>Some object that God would be inconsistent with himself, in inviting all\nwithout distinction while he elects only a few. Thus, according to them,\nthe universality of the promise destroys the distinction of special grace.\n[&#8230;] by external preaching all are called to faith and repentance, and\nthat yet the Spirit of faith and repentance is not given to all [&#8230;] But\nit is by Isaiah he more clearly demonstrates how he destines the promises\nof salvation specially to the elect (Isa. 8:16); for he declares that his\ndisciples would consist of them only, and not indiscriminately of the whole\nhuman race. Whence it is evident that the doctrine of salvation, which is\nsaid to be set apart for the sons of the Church only, is abused when it is\nrepresented as effectually available to all. [&#8230;] Isaiah assigns the cause\nwhen he says that the arm of the Lord is not revealed to all (Isa.&nbsp;53:1).</p>\n<p>How, then, can it consistently be said, that God calls while he knows that\nthe called will not come? [&#8230;] Moreover, if election is, as Paul declares,\nthe parent of faith, I retort the argument, and maintain that faith is not\ngeneral, since election is special. For it is easily inferred from the\nseries of causes and effects, when Paul says, that the Father &#8220;has blessed\nus with all spiritual blessings in heavenly places in Christ, according as\nhe has chosen us in him before the foundation of the world,&#8221; (Eph. 1:3, 4),\nthat these riches are not common to all, because God has chosen only whom\nhe&nbsp;would.</p>\n<p>We come now to the reprobate, to whom the Apostle at the same time refers\n(Rom. 9:13). For as Jacob, who as yet had merited nothing by good works, is\nassumed into favor; so Esau, while as yet unpolluted by any crime, is\nhated. If we turn our view to works, we do injustice to the Apostle, as if\nhe had failed to see the very thing which is clear to us. Moreover, there\nis complete proof of his not having seen it, since he expressly insists\nthat when as yet they had done neither good nor evil, the one was elected,\nthe other rejected, in order to prove that the foundation of divine\npredestination is not in works. Then after starting the objection, Is God\nunjust? instead of employing what would have been the surest and plainest\ndefense of his justice-viz. that God had recompensed Esau according to his\nwickedness, he is contented with a different solution-viz. that the\nreprobate are expressly raised up, in order that the glory of God may\nthereby be displayed. At last, he concludes that God has mercy on whom he\nwill have mercy, and whom he will he hardeneth (Rom. 9:18). You see how he\nrefers both to the mere pleasure of God. Therefore, if we cannot assign any\nreason for his bestowing mercy on his people, but just that it so pleases\nhim, neither can we have any reason for his reprobating others but his\nwill. When God is said to visit in mercy or harden whom he will, men are\nreminded that they are not to seek for any cause beyond his&nbsp;will.</p>\n</blockquote>\n</div>\n", 
    "date_iso": "2013-03-01", 
    "title": "Calvin on predestination", 
    "url": "/2013/03/calvin-on-predestination", 
    "day": "01", 
    "categories": [
        {
            "name": "theology", 
            "slug": "theology"
        }
    ]
}