{
    "reading_time": "about one minute", 
    "month": "06", 
    "year": "2013", 
    "date": "June 13, 2013", 
    "slug": "who-are-the-weak-christians", 
    "contents": "<div class=\"section\" id=\"who-are-the-weak-christians\">\n<h1>Who are the weak&nbsp;Christians?</h1>\n<p>When you look around you while sitting in a church service, you will generally\nhave a sense of who is who.  You know who the nice people are, who the grumps\nare and who always causes trouble.  You know the people who always ask silly\nquestions, and you know the people that always seem to know what to say when\nyou are helpless.  You might have an idea of who is a strong Christian and who\nhas ways to&nbsp;go.</p>\n<p>We all&nbsp;do.</p>\n<p>What does the Bible say about strong and weak Christians?  In Romans 14, Paul\ngives us an answer to this question.  If you are anything like me, his answer\nmight surprise&nbsp;you:</p>\n<blockquote>\nAs for the one who is weak in faith, welcome him, but not to quarrel over\nopinions. One person believes he may eat anything, while the weak person\neats only vegetables. (Romans 14:1-2, <span class=\"caps\">ESV</span>)</blockquote>\n<p>Paul is saying here that the weaker Christian is the kind of person who has\nlesser freedom in Christ.  They think that those who eat meat aren&#8217;t real\nChristians and they need to learn.  They are bound by their conscience to obey\nadditional rules to honor the&nbsp;Lord.</p>\n<p>This is very interesting because our natural inclination is to see those with a\nzeal for good, Christian rules as more mature in the faith.  If you are\nexhorting others to do this and stop doing that, you are more likely to be\nviewed as a mature Christian.  However, the Bible says that the opposite is\ntrue.  Strong Christians have a greater freedom in the gospel than their weaker\nbrothers.  Their conscience doesn&#8217;t prevent them from doing certain things.\nTheir legalistic tendencies are&nbsp;minimal.</p>\n<p>A great example before you go: in Acts 10, Peter is told to eat unclean\nanimals.  These animals were unclean according to the law which was now\nfulfilled in&nbsp;Jesus.</p>\n<blockquote>\nBut Peter said, &#8220;By no means, Lord; for I have never eaten anything that is\ncommon or unclean.&#8221; (Acts 10:14, <span class=\"caps\">ESV</span>)</blockquote>\n<p>Peter&#8217;s conscience is weak and needs to be redeemed by the Holy Spirit.  This\nis a great example of a weak person becoming stronger in the&nbsp;faith.</p>\n</div>\n", 
    "date_iso": "2013-06-13", 
    "title": "Who are the weak Christians", 
    "url": "/2013/06/who-are-the-weak-christians", 
    "day": "13", 
    "categories": [
        {
            "name": "theology", 
            "slug": "theology"
        }
    ]
}