{
    "reading_time": "2 minutes", 
    "month": "04", 
    "year": "2017", 
    "date": "April 28, 2017", 
    "slug": "should-i-finally-drop-qwerty", 
    "contents": "<div class=\"section\" id=\"should-i-finally-drop-qwerty\">\n<h1>Should I finally drop&nbsp;<span class=\"caps\">QWERTY</span>?</h1>\n<p>For years now, I have wanted to switch my keyboard layout from <span class=\"caps\">QWERTY</span> to\nsomething more ergonomic.  <span class=\"caps\">QWERTY</span> was <a class=\"reference external\" href=\"http://discovermagazine.com/1997/apr/thecurseofqwerty1099\">designed</a> to prevent typewriters from\njamming.  Modern computers don&#8217;t have this problem.  So, why are we still using&nbsp;<span class=\"caps\">QWERTY</span>?</p>\n<p>So, for me, it&#8217;s a given that I should switch to something else.  But what?  The\nDvorak layout is the obvious choice.  Most people who switch from <span class=\"caps\">QWERTY</span> end up\nusing Dvorak.  Then there is Programmer Dvorak, and Colemak, and Programmer\nColemak, and hosts of&nbsp;others.</p>\n<p>There are <a class=\"reference external\" href=\"http://patorjk.com/keyboard-layout-analyzer/#/main\">websites</a> that allow you analyze some text, and help you determine\nwhich layout is best for you.  This is of limited utility because the text you\npast in won&#8217;t be representative of your actually&nbsp;habits.</p>\n<div class=\"section\" id=\"getting-down-to-business\">\n<h2>Getting down to&nbsp;business</h2>\n<p>So, how can I hack this?  I installed a <a class=\"reference external\" href=\"https://github.com/kernc/logkeys\">keylogger</a> on my laptop, and\ncollected data for many days.  Then, I wrote a little script to analyze the\ndata.  This is mostly because analysis websites won&#8217;t let you paste in more\nthan a few kilobytes of text.  The most basic measure of how good a keyboard\nlayout is is the percentage of keystrokes that are on the home row.  The idea\nis that if you have to move your fingers less, you will be faster, less tired,\nand experience less&nbsp;pain.</p>\n<p>The script takes the output of the keylogger and gives you percentages of\nkeystrokes that are on the home row for each layout.  Here is what I&nbsp;got:</p>\n<pre class=\"literal-block\">\nqwerty: 38.69149%\ncolemak: 35.601215%\ndvorak-programmer: 34.441067%\ndvorak: 34.441067%\n</pre>\n<p>Wait, what?  <span class=\"caps\">QWERTY</span> is the most optimal keyboard layout for me?  That can&#8217;t be\nright.  Surely, there must be a bug in my code somewhere.  I went over\neverything several times, tested my functions with dummy data, and so on.\nEverything seems to be correct.  You can head over to <a class=\"reference external\" href=\"https://github.com/honza/keylogger\">GitHub</a> and prove me&nbsp;wrong.</p>\n<p>I have been thinking about why I got this bizarre result.  I think it&#8217;s because\nmost of my regular typing isn&#8217;t necessarily writing prose.  There is a lot of\nvim-style navigation (in <a class=\"reference external\" href=\"https://github.com/syl20bnr/spacemacs\">Spacemacs</a>, in the <a class=\"reference external\" href=\"https://vimium.github.io/\">browser</a>, etc), I use <a class=\"reference external\" href=\"https://i3wm.org/\">i3</a> as\nmy window manager, &#8230;  A lot of it is running commands, tab-completing things,\nkeyboard shortcuts.  Other layouts, like Colemak, are probably optimized for\nlong-form writing.  In those cases, it would probably win.  But for\nprogrammer-centric typing, <span class=\"caps\">QWERTY</span> is likely to be king because everything is\noptimized for&nbsp;it.</p>\n<p>What do you&nbsp;think?</p>\n</div>\n</div>\n", 
    "date_iso": "2017-04-28", 
    "title": "Should I finally drop QWERTY?", 
    "url": "/2017/04/should-i-finally-drop-qwerty", 
    "day": "28", 
    "categories": []
}