{
    "reading_time": "about one minute", 
    "month": "01", 
    "year": "2017", 
    "date": "January 26, 2017", 
    "slug": "the-marathon-obsession", 
    "contents": "<div class=\"section\" id=\"the-marathon-obsession\">\n<h1>The Marathon&nbsp;obsession</h1>\n<p>This morning, I read a rather click-baity <a class=\"reference external\" href=\"http://runningmagazine.ca/11-questions-runners-hate-answering/\">article</a> about the kinds of\nquestions that runners hate answering.  Honestly, I don&#8217;t know why I clicked it\n&#8212; blame it on lack of coffee in my blood stream.  A common theme in the\narticle is the obsession with the marathon.  When are you running your first\nmarathon?  Are you training for Boston?  The writer then goes on to say that\nshe is perfectly happy with her 5ks and&nbsp;10ks.</p>\n<p>I&#8217;m also tired of the marathon obsession,  but from the other end of the\nspectrum.  The marathon distance isn&#8217;t the pinnacle of a runner&#8217;s career.  You\ncan run further.  Your legs don&#8217;t magically stop working after&nbsp;42.2km.</p>\n<p>The following quote from Christopher McDougall&#8217;s <em>Born to run</em> gives us a nice\nglimpse into the mindset of an ultra runner.  This tiny section is one of my\nfavorite parts in the&nbsp;book.</p>\n<blockquote>\n<p><span class=\"dquo\">&#8220;</span>So why not marathons?&#8221; I asked Jenn when I called to interview her about\nthe Young Guns. &#8220;Do you think you could qualify for the Olympic&nbsp;Trials?&#8221;</p>\n<p><span class=\"dquo\">&#8220;</span>Dude, seriously,&#8221; she&#8217;d said. &#8220;The qualifying standard is 2:48. Anyone can\nmake it.&#8221; Jenn could run a sub-three-hour marathon while wearing a string\nbikini and chugging a beer at mile 23-and she would, just five days after\nrunning a 50-mile trail race in the Blue Ridge&nbsp;Mountains.</p>\n<p><span class=\"dquo\">&#8220;</span>But then what?&#8221; Jenn went on. &#8220;I hate all this hype about the marathon.\nWhere&#8217;s the mystery? I know a girl who&#8217;s training for the Trials, and she&#8217;s\ngot every single workout planned for the next three years! She&#8217;s doing\nspeedwork on the track like, every other day. I couldn&#8217;t take it, man. I\nwas supposed to run with her once at six in the morning, and I called her\nup at two a.m. to tell her I was shitfaced on margaritas and puh-robably\nnot gonna make&nbsp;it.&#8221;</p>\n<p>Jenn didn&#8217;t have a coach or a training program; she didn&#8217;t even own a\nwatch. She just rolled out of bed every morning, downed a veggie burger,\nand ran as far and as fast as she felt like, which usually turned out to be\nabout twenty miles. Then she hopped on the skateboard she&#8217;d bought instead\nof a parking pass and kicked off to class at Old Dominion, where she&#8217;d\nrecently dropped back into school and was making straight&nbsp;As.</p>\n</blockquote>\n</div>\n", 
    "date_iso": "2017-01-26", 
    "title": "The Marathon Obsession", 
    "url": "/2017/01/the-marathon-obsession", 
    "day": "26", 
    "categories": []
}