{
    "reading_time": "about one minute", 
    "month": "11", 
    "year": "2017", 
    "date": "November 26, 2017", 
    "slug": "red-letter-theology", 
    "contents": "<div class=\"section\" id=\"red-letter-theology\">\n<h1>Red-letter&nbsp;theology</h1>\n<p>Several weeks ago, I had a few friends over to our house to watch Les Lanphere&#8217;s\nexcellent <a class=\"reference external\" href=\"https://www.kickstarter.com/projects/calvinist/calvinist-documentary-film\">Calvinist</a> documentary.  I assumed this would be their first\nexposure to Reformed theology, so I expected some lively discussion.  About half\nway through the movie, we had to pause to answer a simple clarification\nquestion.  Once that was done, one of the guys volunteered an interesting\nobservation.  He said: &#8220;I hope they show some quotes from Jesus, too.  So far\nit&#8217;s just been Paul in Romans and Ephesians.  I wonder what Jesus has to say\nabout&nbsp;that.&#8221;</p>\n<p>This little comment has been on my mind ever since.  The traditional typography\nof Bibles on the North American usually includes words of Christ in red.  Having\ngrown up in Europe, I didn&#8217;t encounter this until I came to Canada about ten\nyears ago.  The motivation behind this typographic design is to give reverence\nto the words of Christ because when he speaks, God himself speaks.\nUnfortunately, what this leads to is that people treat other parts of the Bible\nas less important.  If it&#8217;s not red, it&#8217;s as if you don&#8217;t really have to believe\nit.  This is a really bad way of reading the Bible and doing theology in&nbsp;general.</p>\n<p>A small typographic detail can make a huge difference in how we think about what\nwe&#8217;re reading.  It might be helpful for us to stop and think about the features\nof our Bibles to see how all the references, footnotes, verse numbers, section\nheadings, verse-by-verse layouts affect our reading and understanding of the\ntext of&nbsp;Scripture.</p>\n<p>Related: <a class=\"reference external\" href=\"https://byfaithweunderstand.com/bible-typography-manifesto/\">Bible Typography&nbsp;Manifesto</a></p>\n</div>\n", 
    "date_iso": "2017-11-26", 
    "title": "Red-letter theology", 
    "url": "/2017/11/red-letter-theology", 
    "day": "26", 
    "categories": [
        {
            "name": "theology", 
            "slug": "theology"
        }
    ]
}