{
    "reading_time": "6 minutes", 
    "month": "11", 
    "year": "2017", 
    "date": "November 24, 2017", 
    "slug": "comparing-editions-of-the-institutes", 
    "contents": "<div class=\"section\" id=\"comparing-editions-of-the-institutes\">\n<h1>Comparing editions of the&nbsp;Institutes</h1>\n<img alt=\"/img/calvin.png\" src=\"/img/calvin.png\" />\n<p>The way I see it, you have three options when selection an edition of John\nCalvin&#8217;s Institutes of the Christian&nbsp;Religion.</p>\n<ol class=\"arabic simple\">\n<li>The final edition of 1559 translated by Henry Beveridge, published in&nbsp;1867.</li>\n<li>The final edition of 1559 translated by Ford Lewis Battles, published in&nbsp;1960.</li>\n<li>The French edition of 1541 translated by Robert White, published in&nbsp;2014.</li>\n</ol>\n<div class=\"section\" id=\"beveridge\">\n<h2>Beveridge</h2>\n<p>With <em>Beveridge</em>, you get the full text of the <em>Institutes</em>.  The language is\nsomewhat archaic and a bit convoluted sometimes.  It&#8217;s a lot easier to read than\nthe Puritans.  This translation is in the public domain, so you can read it for\n<a class=\"reference external\" href=\"http://www.ccel.org/ccel/calvin/institutes.i.html\">free online</a>, and printed editions are relatively&nbsp;cheap.</p>\n<p>Book 1, Chapter 1, Section&nbsp;2</p>\n<blockquote>\n<p>On the other hand, it is evident that man never attains to a true\nself-knowledge until he have previously contemplated the face of God, and\ncome down after such contemplation to look into himself. For (such is our\ninnate pride) we always seem to ourselves just, and upright, and wise, and\nholy, until we are convinced, by clear evidence, of our injustice, vileness,\nfolly, and impurity. Convinced, however, we are not, if we look to ourselves\nonly, and not to the Lord also—he being the only standard by the application\nof which this conviction can be produced. For, since we are all naturally\nprone to hypocrisy, any empty semblance of righteousness is quite enough to\nsatisfy us instead of righteousness itself. And since nothing appears within\nus or around us that is not tainted with very great impurity, so long as we\nkeep our mind within the confines of human pollution, anything which is in\nsome small degree less defiled delights us as if it were most pure: just as\nan eye, to which nothing but black had been previously presented, deems an\nobject of a whitish, or even of a brownish hue, to be perfectly white. No,\nthe bodily sense may furnish a still stronger illustration of the extent to\nwhich we are deluded in estimating the powers of the&nbsp;mind.</p>\n<p>If, at mid-day, we either look down to the ground, or on the surrounding\nobjects which lie open to our view, we think ourselves endued with a very\nstrong and piercing eyesight; but when we look up to the sun, and gaze at it\nunveiled, the sight which did excellently well for the earth is instantly so\ndazzled and confounded by the refulgence, as to oblige us to confess that\nour acuteness in discerning terrestrial objects is mere dimness when applied\nto the sun. Thus, too, it happens in estimating our spiritual qualities. So\nlong as we do not look beyond the earth, we are quite pleased with our own\nrighteousness, wisdom, and virtue; we address ourselves in the most\nflattering terms, and seem only less than&nbsp;demigods.</p>\n</blockquote>\n</div>\n<div class=\"section\" id=\"battles\">\n<h2>Battles</h2>\n<p>With <em>Battles</em>, you get the full text in its final form.  This is the academic\nreference edition.  If you are going to write a paper or a book, and you want to\nquote Calvin, use this.  The language is much more modern than <em>Beveridge</em> but\nstill a bit technical at times.  The biggest downside of this edition is that it\ncomes in two volumes and it&#8217;s very&nbsp;expensive.</p>\n<p>Book 1, Chapter 1, Section&nbsp;2</p>\n<blockquote>\n<p>Again, it is certain that man never achieves a clear knowledge of himself\nunless he has first looked upon God&#8217;s face, and then descends from\ncontemplating him to scrutinize himself.  For we always seem to ourselves\nrighteous and upright and wise and holy&#8212;this pride is innate in all of\nus&#8212;unless by clear proofs we stand convinced of our own unrighteousness,\nfoulness, folly, and impurity.  Moreover, we are not thus convinced if we\nlook merely to ourselves and not also to the Lord, who is the sole standard\nby which this judgment must be measured.  For, because all of us are\ninclined by nature to hypocrisy, a kind of empty image of righteousness in\nplace of righteousness itself abundantly satisfies us.  And because nothing\nappears within or around us that has not been contaminated by great\nimmorality, what is a little less vile pleases us as a thing most pure&#8212;so\nlong as we confine our minds within the limits of human corruption.  Just\nso, an eye to which nothing is shown but black objects judges something\ndirty white or even rather darkly mottle to be whiteness itself.  Indeed, we\ncan discern still more clearly from the bodily senses how much we are\ndeluded in estimating the powers of the&nbsp;soul.</p>\n<p>For if in broad daylight we either look down upon the ground or survey\nwhatever meets our view round about, we seem to ourselves endowed with the\nstrongest and keenest sight; yet when we look up to the sun and gaze\nstraight at it, that power of sight which was particularly strong on earth\nis at once blunted and confused by a great brilliance, and thus we are\ncompelled to admin that our keenness in looking upon things earthly is sheer\ndullness when it comes to the sun.  So it happens in estimating our\nspiritual goods.  As long as we do not look beyond the earth, being quite\ncontent with our own righteousness, wisdom and virtue, we flatter ourselves\nmost sweetly, and fancy ourselves all bug&nbsp;demigods.</p>\n</blockquote>\n</div>\n<div class=\"section\" id=\"white\">\n<h2>White</h2>\n<p>With <em>White</em>, you get an earlier version of the <em>Institutes</em>.  It&#8217;s missing\nsome sections from the final, but not much.  This is translated from the French\nedition which is known for its lively prose.  The biggest draw for this edition\nis its recency, only 2014. The language is very modern and flows nicely.  The\nprinted edition costs a bit more than <em>Beverage</em> but still a lot less than\n<em>Battles</em>.  This edition will serve hobbyists well.  The newness of the\nlanguage will provide you with higher likelihood of&nbsp;finishing.</p>\n<p>Book 1, Chapter 1, Section&nbsp;2</p>\n<blockquote>\n<p>Conversely, we observe that no one ever attains clear knowledge of self unless\nhe has first gazed upon the face of the Lord, and then turns back to look upon\nhimself. Deeply rooted in all of us is an arrogance which persuades us that we\nare righteous, truthful, wise and holy. Only clear evidence that we are\nunrighteous, deceitful, foolish and vile will convince us of the contrary. We\nfeel no such conviction if all we do is look upon ourselves and not also upon\nthe Lord. He is the one and only standard with which our judgment must\naccord. But because hypocrisy is something to which we are all naturally prone,\nwe are quite content with an empty show of righteousness rather than with its\nreality. And because there is nothing around us which is not greatly defiled,\nwhatever is a little less grubby appears to us as purity itself, as long as we\nconfine our attention to the limits of our own—debased—humanity. It is like the\neye which, used to seeing only objects that are dark, judges things which are\nvaguely white or even semi-grey to be the whitest there is.  An analogy based on\nphysical sight will help us better understand how badly we misjudge our soul’s&nbsp;powers.</p>\n<p>If in broad daylight we look down at the ground or attend to things which are\nround about us, we have no trouble believing our sight is extremely sharp and\nkeen. When, however, we look straight up at the sun, the power that served us so\nwell on earth is dazed and dazzled by so intense a light, forcing us to admit\nthat our ability clearly to see earthly objects is weak and feeble when it comes\nto gazing at the sun. This is how it is when we try to estimate our spiritual\nstrengths. As long as we do not look beyond earth’s horizons, we are perfectly\ncontent with our own righteousness, wisdom and power.  We flatter and\ncongratulate ourselves, and are not far from thinking we are&nbsp;demigods!</p>\n</blockquote>\n</div>\n</div>\n", 
    "date_iso": "2017-11-24", 
    "title": "Comparing editions of the Institutes", 
    "url": "/2017/11/comparing-editions-of-the-institutes", 
    "day": "24", 
    "categories": [
        {
            "name": "theology", 
            "slug": "theology"
        }
    ]
}