{
    "reading_time": "8 minutes", 
    "month": "11", 
    "year": "2017", 
    "date": "November 02, 2017", 
    "slug": "my-journey-to-find-the-best-bible", 
    "contents": "<div class=\"section\" id=\"my-journey-to-find-the-best-bible\">\n<h1>My journey to find the best&nbsp;Bible</h1>\n<p>&#8230; or, <em><span class=\"caps\">ESV</span> Pitt Minion in black goatskin&nbsp;review</em></p>\n<p>I have been reading Mark Bertrand&#8217;s <a class=\"reference external\" href=\"https://www.bibledesignblog.com/\">Bible Design Blog</a> for a few years now.\nThrough his long-form writing, I have come to appreciate beautiful typography,\nfine craftsmanship, single-column layouts, and attention to detail in modern\nBible-making.  I even helped him with a website update several years&nbsp;ago.</p>\n<p>For the longest time, though, my reading was just that&#8212;reading.  I couldn&#8217;t\nimagine spending so much money on a single Bible.  I already had a few Bibles\nin the house, and there wasn&#8217;t any pressing need to buy another one.  This\nspring, after saving up some money, I decided to invest in a premium Bible.  I\nmade a list of requirements, and I read and watched just about every review I\ncould find on the world wide web.  I was searching for <em>the one</em> Bible, the\nelusive unicorn of typographic design.  I read articles about how that Bible\ndoesn&#8217;t exist, and that I should just come to terms with the fact that I shall\nhave to acquire a few different Bibles, each one for its own intended&nbsp;purpose.</p>\n<p>I became addicted to the idea of single-column design.  I read all about it.  I\ncould absolutely sign Mark Ward&#8217;s <a class=\"reference external\" href=\"https://byfaithweunderstand.com/bible-typography-manifesto/\">Bible Typography Manifesto</a>.  Two years\nbefore the search began, my wife bought me the single-volume <a class=\"reference external\" href=\"https://www.crossway.org/bibles/esv-readers-bible-cob/\"><span class=\"caps\">ESV</span> Reader&#8217;s\nBible</a>.</p>\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/9xhvee27Rkk?rel=0\" frameborder=\"0\" allowfullscreen=\"true\"></iframe><p>This Bible is relatively cheap, and gorgeous.  It looks a lot more like a\nregular book than a dictionary or a reference book.  It features a large font,\nsingle-column layout, &#8230; but its significance is in what it lacks: verse\nnumbers, references, section headings, book introductions, etc.  It&#8217;s very clean\nand a joy to read.  I highly recommend it to anyone, and often show it off to\nvisitors to our house.  My friends are usually dismissive of the idea of a\nsingle column Bible because it doesn&#8217;t look like a <em>real</em> Bible.  The inertia of\nBible design is so tremendous that people experience a mild culture shock when\nlooking at modern&nbsp;Bibles.</p>\n<p>Unfortunately, the Reader doesn&#8217;t work as <em>the one</em>&nbsp;Bible.</p>\n<p>From the start, I knew I didn&#8217;t want to become a Bible collector.  I have no\ndesire to own thousands of dollars worth of Bibles.  I wanted to acquire a\nsingle Bible that I could use in many different scenarios.  The primary\nmotivation for this is that over time, you get to know your Bible, and you will\nlearn where things are, and you can find them quickly.  Professor Grant Horner\nis an advocate of this argument in his <a class=\"reference external\" href=\"http://www.sohmer.net/media/professor_grant_horners_bible_reading_system.pdf\">10 chapters per day reading plan</a> which\nI&nbsp;enjoy.</p>\n<p>So, let&#8217;s see if we can put together a list of priorities.  The Bible must work\nduring private reading, study, public worship, family worship, and adult Bible\nstudy with others.  It must be easy to read, and yet be small enough that it&#8217;s\npractical to carry everywhere.  It must be available in the English Standard\nVersion.  It must be pleasing to the eye and to the touch.  It should be\nrendered in single-column layout.  Since I want it to be as practical as\npossible, it should come with verse numbers, and section headings.  References\nare&nbsp;unimportant.</p>\n<p>I was immediately captivated by Crossway&#8217;s <a class=\"reference external\" href=\"https://www.crossway.org/bibles/esv-heirloom-single-column-legacy-bible-none-gskn/\"><span class=\"caps\">ESV</span> Heirloom Single Column\nLegacy</a>, and Cambridge&#8217;s <a class=\"reference external\" href=\"http://www.cambridge.org/bibles/bible-versions/english-standard-version/clarion/#fWEczIpRK89Frx95.97\">Clarion</a>.</p>\n<p>Here is the&nbsp;Heirloom:</p>\n<img alt=\"/img/esv-heirloom-psalms.jpg\" src=\"/img/esv-heirloom-psalms.jpg\" />\n<img alt=\"/img/esv-heirloom-cover.jpg\" src=\"/img/esv-heirloom-cover.jpg\" />\n<p>(<em>Photos via evangelicalbible.com</em>)</p>\n<p>Judging by the photos in <a class=\"reference external\" href=\"https://www.bibledesignblog.com/blog/2017/8/10/refined-in-every-sense-the-new-heirloom-legacy\">Mark Bertrand&#8217;s review of the new <span class=\"caps\">ESV</span> Heirloom\nLegacy</a>, the Bible looks huge.  This means two things for me: it features a\nlarge, readable page, and it&#8217;s likely too big to carry everywhere.  This would\nmake a great sit-at-home-and-read-for-hours Bible, but I wouldn&#8217;t drag it to\nchurch with me.  Still, the page looks amazing, single column; I love the\nheadings on the side instead of in the text.  I like that it has verse numbers\nand no references.  It makes the text look clean.  This Bible will set you back\n275&nbsp;<span class=\"caps\">USD</span>.</p>\n<p>And here is the&nbsp;Clarion:</p>\n<img alt=\"/img/clarion-open.jpg\" src=\"/img/clarion-open.jpg\" />\n<img alt=\"/img/clarion-cover.jpg\" src=\"/img/clarion-cover.jpg\" />\n<p>(<em>Photos via evangelicalbible.com</em>)</p>\n<p>The Clarion is short and stout.  I like the shape of it better than the Heirloom\nLegacy.  Given its supple cover, it can be difficult to hold.  It features\nreferences and a single-column text block.  For some strange reason, the\nreferences are on the outside.  This causes the text of the Bible to dip into\nthe fold near the spine.  Crossway&#8217;s Personal Reference Bible is also rendered\nin a single column setting but its references are in the middle.  This is a much\nbetter solution in my opinion. Unfortunately, the Clarion seems to have problems\nwith ghosting (also known as show-through), page curling, and while it&#8217;s smaller\nthan the Heirloom, it&#8217;s still rather bulky.  It&#8217;s about the same size as my <span class=\"caps\">ESV</span>\nReader&#8217;s Bible which definitely isn&#8217;t very portable.  The Clarion costs about\n255&nbsp;<span class=\"caps\">USD</span>.</p>\n<p>These two Bibles are absolutely excellent, and very expensive.  If I were a\ncollector, I think both of these should be in my collection.  However, that&#8217;s\nnot why we&#8217;re&nbsp;here.</p>\n<p>After dismissing the Heirloom and the Clarion, I was browsing publishers&#8217;\nwebsites, and came across another Bible from Cambridge: the <a class=\"reference external\" href=\"http://www.cambridge.org/bibles/bible-versions/king-james-version/reference-editions/pitt-minion-first-edition/#EGkUW5ImTubwglOP.97\">Pitt Minion</a>. The\nsize of this Bible is absolutely spot on: not too big (portable), and not too\nsmall (readable), not too short and not fat.  I absolutely love the black\ngoatskin edition with the red accent of a ribbon.  Only problem?  It&#8217;s double&nbsp;column.</p>\n<p>Initially, I dismissed it&#8212;almost immediately.  Who would buy a double column\nBible in 2017?  But I kept thinking about the Pitt Minion, and kept coming back\nto it.  I read all of Mark Bertrand&#8217;s reviews of it over and over.  I think\nthere are at least four articles on his website dedicated to the Pitt Minion.\nMark&#8217;s argument for the Pitt Minion is that its columns are magic.  There is\nsomething about the ratio between the column&#8217;s width, the font size, and the\nleading that makes it just work.  This leads to high readability in spite of\nthe tiny 6.75 font.  Also, the size of the Bible is somewhere in between a\npocket Bible and a medium sized Bible.  This makes it unique in the kind of\nsituations you&#8217;d want to use it&nbsp;in.</p>\n<p>I also greatly benefited from <a class=\"reference external\" href=\"https://www.youtube.com/channel/UCzZeN-hOXtiz9Q0YvVUee8A\">Matthew Everhard&#8217;s</a> videos.  Matthew is a pastor\nwho uses a Pitt Minion has his take-it-with-you-everywhere Bible, and does a\nvideo review once a year to show how the Bible is doing with daily use.  I love\nhow the leather ages, and how the board covers soften as you use&nbsp;it.</p>\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/Z6ZTp7tdXpg\" frameborder=\"0\" allowfullscreen=\"true\"></iframe><p>Once I was willing to seriously consider the double-column layout, I went back\nto the drawing board, as it were, and had another look at the available\noptions.  I have yet to see a Bible from <span class=\"caps\">R. L.</span> Allan that I like (sorry folks).\nBut Schuyler is a different story!  Their Quentel is very intriguing,\nespecially the Personal size&nbsp;version.</p>\n<img alt=\"/img/quentel-1-small.jpg\" src=\"/img/quentel-1-small.jpg\" />\n<img alt=\"/img/quentel-2-small.jpg\" src=\"/img/quentel-2-small.jpg\" />\n<p>(<em>Photos via evangelicalbible.com</em>)</p>\n<p>The only problem is the price.  I live in Canada, and shipping is around 50\n<span class=\"caps\">USD</span>, and I&#8217;m probably going to get hit with import tax fees, etc.  The Bible\nitself is about 175 <span class=\"caps\">USD</span>.  Evangelical Bible really needs to figure a better\ndistribution model for their awesome Bibles.  A lot more people would buy them\nif the shipping were cheaper (e.g. partner with&nbsp;Amazon).</p>\n<p>After much thought, I decided to order the Pitt Minion.  Another huge reason\nwas its price. It costs about 150 <span class=\"caps\">USD</span> and I even found a great deal on Amazon,\nso I ended up paying about 100 <span class=\"caps\">USD</span> (shipped).  Compare that to the 225+ <span class=\"caps\">USD</span> for\nthe Quentel.  The Pitt Minion is a steal!  I opted for the black goatskin which\nto my eyes and heart looks the best.  Just as a side note, you can get the\nClarion for about that price but with a much inferior leather&nbsp;cover.</p>\n<img alt=\"/img/pitt-minion/20171025_0001_thumb.jpg\" src=\"/img/pitt-minion/20171025_0001_thumb.jpg\" />\n<img alt=\"/img/pitt-minion/20171025_0002_thumb.jpg\" src=\"/img/pitt-minion/20171025_0002_thumb.jpg\" />\n<p>Just look at that delicious&nbsp;grain!</p>\n<img alt=\"/img/pitt-minion/20171025_0003_thumb.jpg\" src=\"/img/pitt-minion/20171025_0003_thumb.jpg\" />\n<p>The book opens flat after a few days of handling&nbsp;it.</p>\n<img alt=\"/img/pitt-minion/20171025_0004_thumb.jpg\" src=\"/img/pitt-minion/20171025_0004_thumb.jpg\" />\n<img alt=\"/img/pitt-minion/20171025_0005_thumb.jpg\" src=\"/img/pitt-minion/20171025_0005_thumb.jpg\" />\n<p>Notice the red under gold art gilding on the sides of the pages.  Just&nbsp;gorgeous.</p>\n<img alt=\"/img/pitt-minion/20171025_0006_thumb.jpg\" src=\"/img/pitt-minion/20171025_0006_thumb.jpg\" />\n<img alt=\"/img/pitt-minion/20171025_0007_thumb.jpg\" src=\"/img/pitt-minion/20171025_0007_thumb.jpg\" />\n<p>I love the red accent that the ribbons&nbsp;provide.</p>\n<img alt=\"/img/pitt-minion/20171025_0008_thumb.jpg\" src=\"/img/pitt-minion/20171025_0008_thumb.jpg\" />\n<img alt=\"/img/pitt-minion/20171025_0009_thumb.jpg\" src=\"/img/pitt-minion/20171025_0009_thumb.jpg\" />\n<p>(<em>Photos by me, you can use them for any purpose</em>)</p>\n<p>While I was waiting for it to arrive in the mail, I was rather nervous about\nthe whole thing.  But as soon as I opened the box, I was relieved and happy\nwith the new Bible.  It far exceeded by expectations.  It&#8217;s even more beautiful\nthan in the&nbsp;pictures.</p>\n<p>Right out of the box, the Pitt Minion doesn&#8217;t open flat.  You have to handle it\nand read it for about a week, and then it will happily oblige.  The quality of\nthe print is exceptional.  Many reviewers have said that the font is small.\nThat might be true in the technical sense, but given the high quality of the\nprinting, the font doesn&#8217;t feel small.  Think of it like this: your normal\nBible is like an old <span class=\"caps\">TV</span>, it has very low resolution and unnatural colors.  The\nPitt Minion is your latest 4K smart <span class=\"caps\">TV</span> with life-like colors.  Premium Bibles\nstand out not just wit their binding and covers, but also with the quality of\nthe printing.  I find the font size of the Pitt Minion&nbsp;luxurious.</p>\n<p>Then there is the question of the double column.  I remain convinced on a\ntheoretical level that the single column layout is superior in readability.\nHowever, it does in a sense waste space in poetry sections.  This leads to more\nbulk in the final form factor of the Bible.  In practice, I don&#8217;t feel any\nhindrance in reading the Pitt Minion.  My eye can track the words easily, and I\ndon&#8217;t find I lose my place often when reading for extended periods of time.\nMoreover, there is something to be said about the Bible looking like a Bible,\nand double column is certainly the more traditional look.  I realize this is a\npretty weak argument.  With Cambridge, you are purchasing a piece of history or\nBible publishing history.  Cambridge University Press is the world&#8217;s oldest\nBible printer and publisher.  They have been in continuous operation since 1591\nwhen they published the Geneva&nbsp;Bible.</p>\n<p>Once you handle a premium Bible, you won&#8217;t settle for inferior quality.  I have\nbeen reading from the Pitt Minion for several months now.  I have carried it\nmany places.  I travelled to Europe with it. I certainly don&#8217;t baby this Bible.\nI fold back one side of the cover when reading, I roll it up when it&#8217;s closed,\nand I take it with me when going out.  I find it delightful, and it&#8217;s truly a\ngreat all-around&nbsp;Bible.</p>\n</div>\n", 
    "date_iso": "2017-11-02", 
    "title": "My journey to find the best Bible", 
    "url": "/2017/11/my-journey-to-find-the-best-bible", 
    "day": "02", 
    "categories": [
        {
            "name": "bibles", 
            "slug": "bibles"
        }
    ]
}