{
    "reading_time": "about one minute", 
    "month": "01", 
    "year": "2017", 
    "date": "January 19, 2017", 
    "slug": "water-consumption", 
    "contents": "<div class=\"section\" id=\"water-consumption\">\n<h1>Water&nbsp;consumption</h1>\n<p>During the 2016 edition of the Super Bowl, Colgate ran an ad highlighting our\noverconsumption of water during tooth-brushing.  The ad is emotinally charged\nwith images of people from poverty-ridden countries.  You can watch it&nbsp;below.</p>\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/IS4lGnGfHTw\" frameborder=\"0\" allowfullscreen=\"true\"></iframe><p>Colgate claim that you waste up to 4 gallons (15L) of water if you leave the\nfauset running.  They intend to guilt you into conserving&nbsp;water.</p>\n<p>On a global scale, turning the fauset off when you brush your teeth will have a\nminimal effect.  And not because you are only a single person making a change.\nDomestic consumption accounts for only about 5% of water use.  If we all made a\nchange leading to a reduction of water consumption by 50%, the overall domestic\nuse would drop to 2.5%.  And 50% is pretty&nbsp;dramatic.</p>\n<p>So, who is using all the water in the world?  According to the ground-breaking\nresearch by the people behind the <a class=\"reference external\" href=\"http://www.cowspiracy.com/\">Cowspiracy</a> documentary, 55% of water\nconsumption in the United States goes towards animal agriculture.  An immense\namount of water is required to produce meat and dairy&nbsp;products.</p>\n<img alt=\"/img/cowspiracy.png\" src=\"/img/cowspiracy.png\" />\n<p>So instead of worrying about the running tap, we should stop eating meat and\ndairy.  Doing so will have a much more significant impact on the world.  But of\ncourse, that isn&#8217;t as feel-good as the tooth-brushing&nbsp;story.</p>\n</div>\n", 
    "date_iso": "2017-01-19", 
    "title": "Water consumption", 
    "url": "/2017/01/water-consumption", 
    "day": "19", 
    "categories": []
}