{
    "reading_time": "4 minutes", 
    "month": "04", 
    "year": "2017", 
    "date": "April 20, 2017", 
    "slug": "teaching-my-son-about-computers", 
    "contents": "<div class=\"section\" id=\"teaching-my-son-about-computers\">\n<h1>Teaching my son about&nbsp;computers</h1>\n<p>Just over a year ago, my son Wyatt received his first computer for his sixth\nbirthday.  It&#8217;s a Raspberry Pi, and he has an old <span class=\"caps\">LCD</span> monitor, and a\nkid-friendly mouse and keyboard.  I purposely waited until he could read before\nstarting to teach him about computers.  He&#8217;s a pretty smart kid, reads a lot (a\nHarry Potter book in a weekend), and is somewhat socially awkward.  Perfect for\na&nbsp;programmer.</p>\n<p>The Raspberry Pi doesn&#8217;t have a cover on it.  The first thing I did was teach\nhim what each of the parts on the board is.  This is the brain, this is the\nmemory, this is where power comes in, etc.  His very first task was to plug\neverything in.  He had lots of fun trying to figure out where the <span class=\"caps\">HDMI</span> cable\ngoes, where the mouse and keyboard need to be plugged, etc.  To this day, I\nteach him about debugging hardware issues by randomly unplugging cables when\nhe&#8217;s not&nbsp;around.</p>\n<p>Then we turned it on.  He was very excited about <span class=\"caps\">LED</span> lights coming to&nbsp;life.</p>\n<p>Then we were greeted by a headless login screen.  I made him a proper hacker\nhandle, <tt class=\"docutils literal\">wjp</tt>, which he was very excited about, and I allowed him to select a\npassword.  Then, the computer was&nbsp;ready.</p>\n<p>We started out by learning to use bash.  You type in a command and hit &#8220;enter&#8221;\nto run it.  We explored basic unix commands like <tt class=\"docutils literal\">ls</tt>, <tt class=\"docutils literal\">cd</tt>, <tt class=\"docutils literal\">echo</tt>, and\n<tt class=\"docutils literal\">date</tt>.  Somewhat annoyingly, the hardest concept to explain to a child is\nwhat a file and a directory are.  It tooks us a few tries over many days for the\nconcept to really sink&nbsp;in.</p>\n<p>I taught him to use <tt class=\"docutils literal\">nano</tt> to write simple text documents.  He had fun writing\ndown a list of all the superheroes he could think of, a list of countries, a\nlist of his classmates, and so on.  I installed <tt class=\"docutils literal\">cowsay</tt> which he&nbsp;loved.</p>\n<p>I taught him how to use pipes.  He thought it was hilarious to pipe his\nsuperhero list to <tt class=\"docutils literal\">cowsay</tt>.  We also experimented with <tt class=\"docutils literal\">espeak</tt>.</p>\n<p>Then, I installed and configured <tt class=\"docutils literal\">mutt</tt> for him.  He has his own email address\nand can now communicate with his grandparents in Europe on his own.  He still\nmakes mistakes with the proper email syntax and etiquette but overall does email\nwell.  More than anything, it&#8217;s limited by his typing&nbsp;speed.</p>\n<p>Wyatt also loves his <span class=\"caps\">XMPP</span> client, <tt class=\"docutils literal\">profanity</tt>.  The great thing is that most\npeople that he wants to chat with have Google phones and can interact with him\nwithout having to install&nbsp;anything.</p>\n<p>Annoyingly and most frustratingly, Wyatt has an iPad teacher this year at\nschool.  They do literally everything on iPads.  Every single story he tells\nfrom school involves an iPad.  He wants us to buy him an iPad.  Many of the\nother parents are annoyed about this because it makes children less attentive,\nless creative, and much more easily bored.  And I hate it because it messes up\nhis head about Linux.  No, child, <tt class=\"docutils literal\">ls</tt> is <em>not</em> an app, dammit.  Shut up.  But\nwe make&nbsp;do.</p>\n<p>Then one blessed day, I showed him the <tt class=\"docutils literal\">startx</tt> command to start the X window\nsystem.  He was amazed at the colors and buttons, and everything.  Then, we\nstarted exploring windows, menus, and of course Minecraft.  Yes, kids and their\nMinecraft.  He likes to draw in Tuxpain, play chess, tetris, and write books in&nbsp;Libreoffice.</p>\n<p>A couple of weeks ago, I started teaching him basic programming with Python.  He\nwas very disappointed when he saw the kinds of programs I was going to teach him\nto write.  He was under the impression that he was going to write a program that\ncould turn a movie into a book.  And instead, I suggested we start with &#8220;Hello\nworld!&#8221; and leave <span class=\"caps\">AI</span> for&nbsp;later.</p>\n<p>We started with a simple &#8220;Hello world!&#8221;.  We switched from <tt class=\"docutils literal\">nano</tt> to <a class=\"reference external\" href=\"https://github.com/zyedidia/micro\">micro</a>\nwhich is very similar and has syntax highlighting.  Writing a Hello world\nprogram might seem dumb to experienced programmers but it&#8217;s great at showing the\nnovice how to connect everything together: the file, the interpreter, the\ncommand to run the program,&nbsp;etc.</p>\n<p>Then, we wrote a simple &#8220;Die toss&#8221; program.  He was excited about it because it\ndid something different each time, and not just say the same thing like the\nfirst&nbsp;program.</p>\n<p>Yesterday, we wrote a simple quiz.  This time, he wrote all the code by himself\nwith my telling him how.  Print a question and answers, use <tt class=\"docutils literal\">raw_input()</tt> to\nask for the user&#8217;s selection, and then a simple <tt class=\"docutils literal\">if</tt> statement to determine if\nthey were correct.  It&#8217;s amazing how easy Python makes&nbsp;this.</p>\n<div class=\"highlight\"><pre><span class=\"n\">answer</span> <span class=\"o\">=</span> <span class=\"nb\">raw_input</span><span class=\"p\">()</span>\n\n<span class=\"k\">if</span> <span class=\"n\">answer</span> <span class=\"ow\">is</span> <span class=\"s\">&#39;b&#39;</span><span class=\"p\">:</span>\n    <span class=\"k\">print</span> <span class=\"s\">&#39;You are correct&#39;</span>\n</pre></div>\n<p>It reads like English.  He very quickly got the concept of if statements, and\nstarted writing more and more questions.  Then, of course, every family member\nhad to take the&nbsp;quiz.</p>\n<p>Later that day, he told his mother that he wanted to be a programmer.  He wants\nto write &#8220;apps&#8221;.  His mother suggested that he can ask me to get him a job at\nRed Hat, or that he could work at Google.  He scoffed at that and said he didn&#8217;t\nwant to work on one project for a year like his Dad, and that, please, there are\nno computers or programmers at&nbsp;Google.</p>\n</div>\n", 
    "date_iso": "2017-04-20", 
    "title": "Teaching my son about computers", 
    "url": "/2017/04/teaching-my-son-about-computers", 
    "day": "20", 
    "categories": []
}