{
    "reading_time": "2 minutes", 
    "month": "10", 
    "year": "2018", 
    "date": "October 22, 2018", 
    "slug": "is-prayer-a-vibration", 
    "contents": "<div class=\"section\" id=\"is-prayer-a-vibration\">\n<h1>Is prayer a&nbsp;vibration?</h1>\n<p>Recently, I came across an item someone in my Facebook timeline shared.  The\nauthor was thinking about what prayer is.  Here is what it&nbsp;said:</p>\n<blockquote>\n<p>Do you&nbsp;pray?</p>\n<p>I love this interpretation of a Prayer.  What is a prayer?  Prayer doesn&#8217;t\nonly happen when we kneel or put our hands together and focus and expect\nthings from God.  Thinking positive and wishing good for others is a prayer.\nWhen you hug a friend.  That&#8217;s a prayer.  When you cook something to nourish\nfamily and friends.  That&#8217;s a prayer.  When we send off our near and dear\nones say, &#8220;Drive safely&#8221; or &#8220;Be safe&#8221;.  That&#8217;s a prayer.  When you are\nhelping someone in need by giving your time and energy.  You are praying.\nPrayer is a vibration.  A feeling.  A thought.  Prayer is the voice of love,\nfriendship, genuine relationships.  Prayer is an expression of your silent\nbeing.  Keep praying&nbsp;always&#8230;</p>\n</blockquote>\n<p>The interesting part is that this person is a professed Christian.  How can\nsomeone who regularly attends a church service where the Word of God is preached\narrive at a definition like this one?  The modern evangelical church has lost\nits rigor in teaching pure doctrine to its members.  There is often very little\nstructure and precision.  I&#8217;d suggest that we have failed our people if we\nneglect to explain such basic concepts as&nbsp;prayer.</p>\n<p>However, since the Reformation, there has been a strong tradition of teaching\ndoctrine in the form of catechism: prepared questions and answers that the\nstudents were expected to memorize.  From a young age, children were taught how\nto articulate the core tenets of their faith.  The catechism explains doctrines\nof Scripture, sin, justification, sanctification, repentance; it covers the ten\ncommandments, and the Lord&#8217;s prayer.  This practice is unfortunately foreign to\nthe modern evangelical&nbsp;church.</p>\n<p>Why am I bring all this up?  Here is Question 98 of the <a class=\"reference external\" href=\"https://en.wikipedia.org/wiki/Westminster_Shorter_Catechism\">Westminster Shorter\nCatechism</a>, it asks &#8220;What is prayer?&#8221;.  Here is the answer succinct answer\nwhich wonderfully summarizes what prayer is according to the&nbsp;Scriptures:</p>\n<blockquote>\nPrayer is an offering up of our desires unto God, for things agreeable to\nhis will, in the name of Christ, with confession of our sins, and thankful\nacknowledgment of his mercies.</blockquote>\n<p>If you have memorized a catechism, you will have a framework in your mind by\nwhich you can assess new ideas coming at your from social media.  It can serve\nas a useful sieve for quickly determining what is pure doctrine, and what is of\nthe&nbsp;world.</p>\n<p>And lastly, here is an example of <a class=\"reference external\" href=\"https://www.youtube.com/watch?v=uWGITMy33IA\">how to catechize your children</a> on the\nLord&#8217;s&nbsp;day.</p>\n</div>\n", 
    "date_iso": "2018-10-22", 
    "title": "Is prayer a vibration?", 
    "url": "/2018/10/is-prayer-a-vibration", 
    "day": "22", 
    "categories": []
}