{
    "reading_time": "6 minutes", 
    "month": "04", 
    "year": "2019", 
    "date": "April 01, 2019", 
    "slug": "on-having-a-standard-translation-of-the-scriptures", 
    "contents": "<div class=\"section\" id=\"on-having-a-standard-translation-of-the-scriptures\">\n<h1>On having a standard translation of the&nbsp;Scriptures</h1>\n<p>As I have been thinking through the arguments leveled by the advocates of the\ntraditional text of Scripture, a certain irritation with modern bible\ntranslations has entered my mind.  Not with any translation in particular, but\nwith the endless proliferation of them.  James White <a class=\"reference external\" href=\"https://www.youtube.com/watch?v=G6adiAs3_UY\">echoes</a>&nbsp;this:</p>\n<blockquote>\nI certainly believe we have all the English translations that we need.\nThere is absolutely no need for any further English translations.  And 90%\nof what we have could definitely be retired without causing any problems.\nThe reason that we have the number of English translations we have is simply\nbusiness.  It&#8217;s business and it&#8217;s money.  Basically, the large Christian\npublishing firms all now have their own English translation.  Zondervan has\nthe <span class=\"caps\">NIV</span>, Thomas Nelson has the <span class=\"caps\">NKJV</span>, and Crossway has the <span class=\"caps\">ESV</span>, and Holman\nhas the <span class=\"caps\">HCSB</span>&#8230; This point is, there came a time when if you want to put out\na study bible, you didn&#8217;t want to have to pay royalties to someone else\nbecause that would cut your margin of profit on each of those study bibles.\nSo, let&#8217;s be honest, the origin of the <span class=\"caps\">ESV</span> comes from business.  And almost\nall the modern translations, that&#8217;s the case. [&#8230;] Anyway, that&#8217;s where\nthey came from.  We don&#8217;t need any more NLTs which I wouldn&#8217;t even consider\nto be a <em>T</em> in the first place.  We don&#8217;t need any more super simplified\nfirst-grade level translations of the New Testament.  We got a glut of them,\nand most of them aren&#8217;t really worth the paper they&#8217;re printed on in the\nfirst place.  So, the <span class=\"caps\">ESV</span> came along, and Crossway knew how to market that\nthing.  I mean, Lockman could have learned something from them.  The <span class=\"caps\">ESV</span>\nisn&#8217;t all that different from the <span class=\"caps\">NASB</span>.  I have frequently called it the\n<span class=\"caps\">NASB</span> without the semicolons.  But Lockman held way too tight on the <span class=\"caps\">NASB</span>.\nThey kept it too tightly licensed, and stuff like that.  And the <span class=\"caps\">ESV</span> guys\ncome along, and man, they hand them out on college campuses and at bible\ncolleges.  They locked John Piper in a room until he sang its\npraises. (chuckle) They just did it right.  And it has just exploded, and\ntaken over the market. [&#8230;]  And it has beaten the <span class=\"caps\">NIV</span> to death.  Of\ncourse, the <span class=\"caps\">NIV</span> ended up being purchased by a big, seecular corporation that\ndid not know how to handle it.  So, it has really become the big boy.</blockquote>\n<p>Christian publishers want to make money, there is nothing wrong with that.  But\nwhy is the increasing number of translations a&nbsp;problem?</p>\n<p>The problem is that there isn&#8217;t and cannot be an expectation of a standard\nEnglish text of Scripture.  More and more translations are produced, and every\nfew years we are asked to switch to the latest and greatest manifestation of\nwhat scholars deem as literal, faithful, and possessing literary beauty.  The\nprevious incarnation isn&#8217;t good enough anymore.  Church leaders will write\narticles, blog posts, and produce YouTube videos where they will explain to us\nwhy there is a new translation we&#8217;re asked to consider.  And all of this is\ndriven by business, as White says.  At this point, you might have your <span class=\"caps\">KJV</span> bible\nyou used when you were growing up, the <span class=\"caps\">NIV</span> bible you loved in the 1990s, and now\nyou claim that the <span class=\"caps\">ESV</span> is the best bible&nbsp;translation.</p>\n<p>Now, I&#8217;m all for being flexible, and adopting new ideas if they are good and\nsound.  I have no problem with modern translations <em>per se</em>.  I&#8217;m not one of\nthose people in your church who grumble about every change that might be\nintroduced.  But at the same time, I like continuity and&nbsp;legacy.</p>\n<p><tt class=\"docutils literal\">* * *</tt></p>\n<p>Imagine this: You are the first person in your family to become a Christian.\nYou marry a godly woman, and you start a family.  You do your research, and\nafter much deliberation you decide that the <span class=\"caps\">ESV</span> is the translation you are going\nto use.  You invest in nice editions for every member of your family.  Your\nchurch uses the <span class=\"caps\">ESV</span>.  You memorize large portions of Scripture in the <span class=\"caps\">ESV</span>.  You\nteach your children bible verses from the <span class=\"caps\">ESV</span>.  You read books that quote the\n<span class=\"caps\">ESV</span>.  You <a class=\"reference external\" href=\"https://www.desiringgod.org/articles/dads-write-in-your-bible\">read articles</a> that encourage you to write in your bible, and to\npass it down to your children.  You spend thousands of hours reading your\nbible.  You know where on the page your beloved passages are.  The pages have\nscribbles everywhere, many are bent, and ruffled, and some are covered in sweat\nand tears.  You spend your life with this bible.  The Lord uses its words to\nchange you, to &#8220;conform you to the image of his Son&#8221;.  You speak its words of\nwisdom to your grandchildren, just as their parents&nbsp;do.</p>\n<p>And then, it happens.  A new bible translation is published.  The publisher&#8217;s\nmarketing department locks the likes of John Piper into a room until they sing\nits praises.  Your church switches to this translation.  Quoted passages in\nbooks and sermons no longer sound familiar to you.  They are like a distant\necho, or a blurry memory.  You are now an elder in your church, and every few\nweeks you are asked to read Scripture during worship or to lead the congregation\nin prayer.   You bring your beloved bible to the pulpit, and read from it.  The\nyoung people in your church tease you for <em>still</em> using <em>that</em> old thing.  The\nbible you have pored over, and wept over.  You feel betrayed by your church, and\ngrieve the&nbsp;loss.</p>\n<p><tt class=\"docutils literal\">* * *</tt></p>\n<p>Even if you choose a modern translation as your forever translation, you can&#8217;t\nbe sure that it won&#8217;t change from under you.  For example, the <span class=\"caps\">ESV</span> was published\nin 2001.  Then, it underwent revisions in 2007, 2011, and 2016.  The 2016\nedition was originally declared to be the final text, and then the decision was\ninfamously reverted.  Now, we can expect the <span class=\"caps\">ESV</span> to change at some point or\npoints in the&nbsp;future.</p>\n<p>Your other option is to choose the King James Version (I can already see the eye\nrolls).  Joel Beeke <a class=\"reference external\" href=\"https://youngpuritan.wordpress.com/2008/12/11/beeke-on-bible-versions-practical-reasons-for-retaining-the-kjv/\">wants you to</a>.  It was first published in 1611, and\nunderwent a few revisions, and its final form was produced in 1769.  It is the\nbible that sounds like the bible.  It has the <em>thees</em> and the <em>thous</em>.  It has\nwords that aren&#8217;t part of our normal vocabulary anymore.  What&#8217;s worse, it has\nwords that don&#8217;t mean the same thing anymore, and confuse the modern reader.\nThe Puritans quote the <span class=\"caps\">KJV</span> so that would be nice.  The framers of our Reformed\nconfessions used the <span class=\"caps\">KJV</span>.  The church recites the Lord&#8217;s prayer in the words of\nthe <span class=\"caps\">KJV</span>.  It&#8217;s probably a bible that&#8217;s been read for generations in your family.\nThe text is in the public domain, and so printed editions are cheaper, and there\nare tons of free online tools to help you study the&nbsp;bible.</p>\n<p>Should the <span class=\"caps\">ESV</span> become the new <span class=\"caps\">KJV</span>?  The <span class=\"caps\">KJV</span> isn&#8217;t perfect, and neither is the\n<span class=\"caps\">ESV</span>.  Is Crossway a good steward of a standard translation of the&nbsp;bible?</p>\n<p>Does this even matter?  Will our children use printed bibles?  Will they\nmemorize Scripture or just use the search function of their favorite bible app?\nWouldn&#8217;t you be better writing your notes into a document or an app on your\ncomputer, instead of in your&nbsp;bible?</p>\n</div>\n", 
    "date_iso": "2019-04-01", 
    "title": "On having a standard translation of the Scriptures", 
    "url": "/2019/04/on-having-a-standard-translation-of-the-scriptures", 
    "day": "01", 
    "categories": [
        {
            "name": "theology", 
            "slug": "theology"
        }
    ]
}