{
    "reading_time": "2 minutes", 
    "month": "01", 
    "year": "2019", 
    "date": "January 22, 2019", 
    "slug": "he-forgave-how-much", 
    "contents": "<div class=\"section\" id=\"he-forgave-how-much\">\n<h1>He forgave how&nbsp;much?!</h1>\n<img alt=\"/img/bills.jpg\" src=\"/img/bills.jpg\" />\n<p>In <a class=\"reference external\" href=\"http://esv.to/Mt18.23-35\">Matthew 18:23-35</a> we find the Parable of the Unforgiving Servant.  The\nstory goes like this: a king wants to settle his accounts, and calls to himself\nhis servant who owes him a sum of money.  The servant is unable to pay, and\nfalls down before the king, begging for mercy.  The king relents and wipes the\nservant&#8217;s slate clean.  The story follows from there, and the servant whom the\nking forgave his debt is now demanding that his own servant pay him back the\nmoney he is owed.  The second servant is likewike unable to repay the sum of\nmoney, and begs for mercy.  The first servant, however, is harsh and doesn&#8217;t act\nin a merciful way.  He throws his debtor into&nbsp;jail.</p>\n<p>The basic lesson here is that in Christ we have been forgiven a huge debt, and\ntherefore we should forgive&nbsp;others.</p>\n<p>Last night, during family worship we read this passage in our reading of\nMatthew.  I noticed that my <span class=\"caps\">ESV</span> bible has a footnote for the amount that the\nservant owed to the king.  In verse 24, it says that the sum was &#8220;ten thousand\ntalents&#8221;, and then the footnote explains that a &#8220;talent was a monetary unit\nworth about twenty years&#8217; wages for a laborer&#8221;.  That sounds like a lot of\nmoney.  But how much&nbsp;exactly?</p>\n<p>We live in Canada, in the great province of Nova Scotia where minimum wage is\n$11/h.  If we say that the average laborer works 40h per week, 52 weeks a year,\nwe can calculate the annual wage as approximately $22,880.  If we multiply that\nby twenty, we will get $457,600, which is the rough value of a talent in today&#8217;s\ncurrency.  The servant had to pay the king 10,000 talents.  This is\n$4,567,000,000.  Four and a half billion&nbsp;dollars.</p>\n<p>Now imagine you owed someone that kind of money.  There is absolutely no way an\nordinary person could ever repay that.  And this is the size of our sin.  Our\nsin is so vast that we can never repay God.  And <em>yet</em>, he forgives&nbsp;us.</p>\n<p>So, how much did the second servant owe?  What amount had him thrown in jail?\nIn verse 28, it says the amonut was &#8220;a hundred denarii&#8221; and the footnote again\nexplains that a &#8220;denarius was a day&#8217;s wage for a laborer&#8221;.  One denarius is 8h\nof work at $11/h, that is $88.  One hundred is then $8,800, the sum that the\nsecond servant owed.  Not exactly pocket change but still <em>significantly</em> less\nthan what the king forgave the first.  And so, we are to forgive others because\ntheir debt to us is <em>significantly</em> less than what God in Christ forgave&nbsp;us.</p>\n</div>\n", 
    "date_iso": "2019-01-22", 
    "title": "He forgave how much?!", 
    "url": "/2019/01/he-forgave-how-much", 
    "day": "22", 
    "categories": [
        {
            "name": "theology", 
            "slug": "theology"
        }
    ]
}