{
    "reading_time": "about one minute", 
    "month": "01", 
    "year": "2020", 
    "date": "January 09, 2020", 
    "slug": "the-lords-prayer-and-the-critical-text", 
    "contents": "<div class=\"section\" id=\"the-lord-s-prayer-and-the-critical-text\">\n<h1>The Lord&#8217;s prayer and the critical&nbsp;text</h1>\n<p>Proponents of modern bible translations and the critical text in general argue\nthat the <span class=\"caps\">KJV</span> should be abandoned for ecclesiastical use.  The two main\narguments are (1) its archaic language, and (2) inferior Greek&nbsp;text.</p>\n<p>Firstly, biblical doctrine is complex, and if we want to reach the world, we\nshould endeavor to remove as many obstacles as possible.  The lowest hanging\nfruit appears to be the translation of the bible.  We want it to be as simple\nas possible to facilitate faster understanding.  The <span class=\"caps\">KJV</span> is too archaic, and\nhinders the modern person&#8217;s ability to meditate on the Word of God.  The <span class=\"caps\">KJV</span>\nobscures the&nbsp;bible.</p>\n<p>Secondly, the <span class=\"caps\">KJV</span> was produced at the beginning of the seventeenth century.\nSince then, more New Testament manuscripts have been discovered.  These\nmanuscripts, especially the papyri, are much older than the materials the <span class=\"caps\">KJV</span>\ntranslators used.  We now have a better bible.  We can remove verses that\naren&#8217;t original; verses added by overzealous scribes either on purpose or by&nbsp;accident.</p>\n<p>We could discuss the merits of those two arguments.  Instead, I&#8217;d like to draw\nyour attention to the Lord&#8217;s prayer.  Meant as a template or a model for\nprayer, it&#8217;s nevertheless often recited corporately during worship as a means\nto foster unity.  In most cases, it&#8217;s recited in its traditional rendering\nwhich comes from the King James&nbsp;Version.</p>\n<p><em>Our father, which art in heaven, hallowed by thy&nbsp;name</em></p>\n<p>This is some seriously archaic language.  What&#8217;s more, however, is that the\nprayer is concluded&nbsp;with</p>\n<p><em>for thine is the kingdom, and the power, and the glory, forever.&nbsp;Amen</em></p>\n<p>The conclusion of the Lord&#8217;s prayer is recorded in Matthew 6:13.  This very\nverse contains a significant textual variant which removes the conclusion of\nthe Lord&#8217;s prayer.  The oldest and supposedly best manuscripts omit this verse.\nSo, not only are we using archaic language, we are also using a disputed text.\nI see this as an inconsistency on the part of modern translation proponents who\ndismiss the <span class=\"caps\">KJV</span> as being archaic, mock those who prefer it, and then continue\nto use it in&nbsp;worship.</p>\n</div>\n", 
    "date_iso": "2020-01-09", 
    "title": "The Lord's prayer and the critical text", 
    "url": "/2020/01/the-lords-prayer-and-the-critical-text", 
    "day": "09", 
    "categories": [
        {
            "name": "theology", 
            "slug": "theology"
        }
    ]
}